// Лабораторная работа номер 1 по информатике Вариант 1

// Задание 1

//#include <iostream>
//using namespace std;
//int main() {
//	float a;
//	cout << "Введите ваш доход:";
//	cin >> a;
//	if (a <= 50000){
//		float b = a * 0.13;
//		cout << "Ваш доход на налог: " << b << endl;
//	}else if (a <= 100000){
//		float b = a * 0.2;
//		cout << "Ваш доход на налог: " << b << endl;
//	}else{
//		float b = a * 0.25;
//		cout << "Ваш доход на налог: " << b << endl;
//	}
//	return 0;
//}

// Задание 2

//#include <iostream>
//using namespace std;
//int main() {
//	double k = 10;
//	for (int i = 1; i <= 10;i++){
//		cout << i << "  " << k << endl;
//		k += 10;
//	}
//	return 0;
//}





